'''
    Написать программу «Hello Word» выполнив вывод на экран строки, 
    с использованием процедуры. Программа должна удовлетворять всем 
    требованиям линтера или не исправление этих требований должно быть обосновано.
'''

def print_hello():
    """Функция для вывода строки 'Hello World'."""
    print("Hello World")


print_hello()
